app/Http/Controllers/RoleController.php

select * from `roles` limit 10 offset 0
select count(*) as aggregate from `roles` where `name` LIKE '%[object Object]%'
---
    public function index()
    {
        request()->validate([
            'sortDir' => ['nullable', 'in:asc,desc'],
            'sort' => ['nullable', 'in:id,name,email'],
        ]);
        return Inertia::render('Roles/Index', [
            'search' => request()->search,
            'sort' => request()->sort ?? 'id',
            'sortDir' => request()->sortDir ?? 'asc',
            'roles' => Role::query()
                ->when(request()->search, fn($q) => $q->where('name', 'LIKE', '%' . request()->search . '%'))
                ->when(request()->sort, fn($q) => $q->orderBy(request()->sort, request()->sortDir))
                ->paginate(10)

select * from `roles` where `roles`.`id` = '12' limit 1
delete from `roles` where `id` = 12
---
    public function destroy(Request $request, string $id)
    {
        dd([$request, $id]);
        $role = Role::query()->find($id);
        if (!$role) {
            return Redirect::back()->with('error', 'Permissão não encontrada.!');
        }
        $role->delete();