app/Http/Controllers/RoleController.php

    public function index()
    {
        request()->validate([
            'sortDir' => ['nullable', 'in:asc,desc'],
            'sort' => ['nullable', 'in:id,name,email'],
        ]);
        return Inertia::render('Roles/Index', [
            'sort' => request()->sort ?? 'id',
            'sortDir' => request()->sortDir ?? 'asc',
            'roles' => Role::all(),
            'abilities' => Ability::all(),
---
select * from `abilities`