app/Http/Controllers/UserController.php

    public function index()
    {
        request()->validate([
            'sortDir' => ['nullable', 'in:asc,desc'],
            'sort' => ['nullable', 'in:id,name,email'],
        ]);
        return Inertia::render('Users/Index', [
            'search' => request()->search,
            'sort' => request()->sort ?? 'id',
            'sortDir' => request()->sortDir ?? 'asc',
            'users' => User::query()
                ->when(request()->search, fn($q) => $q->where('name', 'LIKE', '%' . request()->search . '%'))
                ->when(request()->sort, fn($q) => $q->orderBy(request()->sort, request()->sortDir))
                ->paginate(10),
        ]);
---
select * from `users`
select * from `users` where `name` LIKE '%m%' order by `id` asc limit 10 offset 0
select count(*) as aggregate from `users` where `name` LIKE '%ad%'

    public function destroy(string $id)
    {
        $user = User::query()->find($id);

        if (!$user) {
            return Redirect::back()->with('error', 'Usuário não encontrado.');
        }

        $user->delete();
---
select * from `users` where `users`.`id` = '23' limit 1
delete from `users` where `id` = 23